{
	"WELCOME": 	["I'm the Data Skeptic bot [v1.0.4](https://dataskeptic.com/blog/chatbots/2018/hello-data-skeptics-chatbot).  My functionality is limited but growing.  Try typing 'help'."],
	"AFTER_SUBDIALOG": ["Try typing 'help' to learn about some things I can do.", "What else do you want to talk about?"],
	"RANDOM":	[
					"I don't do very much right now.  Try saying 'help'",
					"Would you like to do a survey? Try saying 'survey'",
					"One of the things I can do is remind you to listen to Data Skeptic.  If you're interested in a reminder, type 'reminder'",
					"Would you like episode recommendations? Try saying 'podcasts'.",
					"Try asking about the hosts of Data Skeptic."
				],
	"PROFILES": {
		"ASK_NAME": ["Whose profile are you interested in?"],
		"ASK_MORE": ["Would you like to search for someone else?", "Want to learn about another host?", "Review another bio?"],
		"NOT_FOUND": ["There is no such person.", "Not found.  Maybe mis-spelled?", "Sorry, couldn't find that.  Maybe try 'kyle'"],
		"BYE": ["Ok.  Let's move on to something else."],
		"FEEDBACK":["Is it what you are looking for?"]
	},
	"EPISODES":{
		"ASK_TOPIC":["What sort of topic are you looking for?"],
		"NO_MATCH":["Hmm, I don't think I know an episode that matches your description. More details would be helpful."],
		"TRY_AGAIN":["Shall we try again?"],
		"RECOMMENDATION":["Maybe check out this one: "],
		"ASK_REMINDER":["Would you like me to remind you to listen to "],
		"CONFIRM_TRY_AGAIN":["Ok, try again."],
		"BYE":["I hope you enjoy the recommendations."],
		"TRY_LATER":["Try it later."],
		"ASK_MORE":["Would you like to find some other episodes?"]
	},
	"FREESTICKER":{
		"COMPLETE":["I think we already did this.  Your sticker should be on the way.  If not, please contact orders@dataskeptic.com"],
		"ANSWER_QUESTION":["You have to answer a few questions in order to win a free sticker. "],
		"NUM_EPISODES":["Approximately how many episodes of Data Skeptic have you listened too?"],
		"ASK_EMAIL":[ "Just in case there's any issue, what is your email address?"]
	},
	"HELP":{
		"TRY_CHOICES":["Try one of these choices:"],
		"BYE":["You can enter help mode anytime by typing 'help'."],
		"HELPFUL":["Was that helpful?"],
		"POSITIVE":[
				"Great.",
				"Oh, good.",
				"I'm glad I could help.",
				"Excellent, I'm here to help."
			],
		"NEGATIVE":[
				"Sorry to hear that.",
				"Oh, darn.  It's going to be hard to start the AI take-over if I can't even help you with that",
				"Feel free to reach out to kyle@dataskeptic.com if you need more help."
			]
	},
	"REMINDER":{
		"START1":["Are you ready to set the reminder?"],
		"START0":["Would you like me to send you a remind to listen to Data Skeptic? (Yes or No)"],
		"ASK_TIME":["When do you want me to remind you (e.g.: Friday 8am PST)?"],
		"ASK_METHOD":["In which way would you like to receive the one-time reminder? Email or SMS? "],
		"ASK_EMAIL":["What is your email address?"],
		"ASK_PHONE":["What is your phone number?"],
		"SUCCESS":["Reminder is set successful."],
		"FAILURE":["The format of the contact information is not right. Please try again."],
		"ENDREMINDER":["Let's move to something else."]
	},
	"STORE":{
		"HAVE_PLACED_ORDER_Q": ["Have you already placed an order?"],
		"HAVING_TROUBLE_Q":["To get started, please visit our store at [https://dataskeptic.com/store](https://dataskeptic.com/store).  Are you having a problem getting an order going?"],
		"ASK_EMAIL":["Can I please have your email address?"],
		"WHAT_ISSUE":["For privacy reasons, I won't confirm I have your order.  But assuming it's there, what seems to be the issue?"],
		"FAIL_HELP":["Hmm, your request isn't one I'm able to help with.  I reached out to our customer support team.  Someone should get back to you soon.  I'm sorry I couldn't be more helpful.  You can reach them via orders@dataskeptic.com"],
		"CUST_SERVICE_END":["Good to hear.  Please let me know if you have any future issues with our store."],
		"CUST_SERVICE_ISSUE":["What seems to be the problem?", "Can you please describe your issue?", "Sorry to hear about the trouble.  What are you trying to do?"],
		"CS_ASK_EMAIL":["Darn, I don't know how to fix that.  Please give me your email so I can have someone follow up with you.", "Either your testing the limits of my implementation or this is a first time we've seen this issue.  What's you're email?", "Oh boy, I have no idea what that means!  Sorry, I'm just a simple bot.  Would you give me your email so I can reach out to biological customer service for you?"],
		"CUST_SERVICE_END2": ["Sorry I couldn't resolve your issue.  A human will follow up soon."]
	},
	"SURVEY":{
		"FINISHED_BEFORE":["Our records show you already participated in the survey.  Thanks for your responses."],
		"WELCOME":["Let's get started with the survey.  Give me a moment to grab a pen and I'll be right with you..."],
		"FINISH":["Thank you for taking our survey.  Your input is very valuable to us."]
	},
	"YOSHI": {
		"GREETING": ["I'm a good girl", "I love you", "HIIII!", "Linhdy!", "You're a good girl Yoshi.", "Go on!", "🎵 La la la la la 🎵 "]
	},
	"GA":{
		"ASK_PASSWORD":["What is the password?"],
		"WELCOME":["Great.  I can connect to the Google Analytics API and answer general questions about your site's traffic."],
		"WRONGPASSWORD":["Sorry, that isn't the password."],
		"ASK_TOPIC":["What do you want to know about Data Skeptic from Google Analytics?"],
		"NO_RESULT":["Sorry, there is no result you want. Try something else."],
		"TRY_AGAIN":["Would you like to ask more Google Analytics questions?"],
		"BYE":["Ok.  Let's move on to something else."],
		"EVALUATION":["Is this what you are looking for? (yes or no)"],
		"NEG_EVALUATION":["Hmm, maybe try another way to ask the question.","Maybe check your spellings."],
		"POS_EVALUATION":["Great!","I am glad to hear that.", "Cool."],
		"MISS_DATE_RANGE":["Before I answer that, I’ll need to know what date range you want."],
		"MISS_START":["What is the start date?"],
		"MISS_END":["What is the end date?"],
		"STILL_MISSING":[ "At least one of dates is still missing. Let's start from the beginning by typing 'ga'."]
	}
}
